NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_flpr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC00_NS">
      <name>GLOBAL_DPPIC00_S</name>
      <description>Distributed programmable peripheral interconnect controller 1</description>
      <baseAddress>0x50042000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_PPIB00_NS</name>
      <description>PPIB APB registers 0</description>
      <baseAddress>0x40044000</baseAddress>
      <headerStructName>PPIB</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>PPIB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_SEND[%s]</name>
          <description>Description collection: This task is unused, but the PPIB provides the SUBSCRIBE task to connect SEND [n] task.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_SEND</name>
              <description>This task is unused, but the PPIB provides the SUBSCRIBE task to connect SEND [n] task.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_SEND[%s]</name>
          <description>Description collection: Subscribe configuration for task SEND[n]</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task SEND[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_RECEIVE[%s]</name>
          <description>Description collection: This event is unused, but the PPIB provides the PUBLISH event to connect RECEIVE [n] event.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_RECEIVE</name>
              <description>This event is unused, but the PPIB provides the PUBLISH event to connect RECEIVE [n] event.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_RECEIVE[%s]</name>
          <description>Description collection: Publish configuration for event RECEIVE[n]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event RECEIVE[n] will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>OVERFLOW</name>
          <description>Unspecified</description>
          <headerStructName>PPIB_OVERFLOW</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>SEND</name>
            <description>The task overflow for SEND tasks using SUBSCRIBE_SEND. Write 0 to clear.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SEND_0</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[0].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_1</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[1].</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_2</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[2].</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_3</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[3].</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_4</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[4].</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_5</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[5].</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_6</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[6].</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_7</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[7].</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_8</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[8].</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_9</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[9].</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_10</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[10].</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_11</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[11].</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_12</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[12].</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_13</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[13].</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_14</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[14].</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_15</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[15].</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_16</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[16].</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_17</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[17].</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_18</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[18].</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_19</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[19].</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_20</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[20].</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_21</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[21].</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_22</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[22].</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
